# RbsElecCircuitSlotIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecCircuitSlotIndex Property
ParameterTypeId Class See Also
---
"Slot Index"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecCircuitSlotIndex { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecCircuitSlotIndex As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecCircuitSlotIndex {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace